ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR32DA48def.inc
; LUT Input 1 Source Selection
.equ CCL_INSEL1_MASK_gc = (0x00<<4)      ; Masked input
.equ CCL_INSEL1_FEEDBACK_gc = (0x01<<4)  ; Feedback input source
.equ CCL_INSEL1_LINK_gc = (0x02<<4)      ; Linked LUT input source
.equ CCL_INSEL1_EVENTA_gc = (0x03<<4)    ; Event input source A
.equ CCL_INSEL1_EVENTB_gc = (0x04<<4)    ; Event input source B
.equ CCL_INSEL1_IN1_gc = (0x05<<4)       ; IO pin LUTn-IN1 input source
.equ CCL_INSEL1_AC1_gc = (0x06<<4)       ; AC1 OUT input source
.equ CCL_INSEL1_ZCD1_gc = (0x07<<4)      ; ZCD1 OUT input source
.equ CCL_INSEL1_USART1_gc = (0x08<<4)    ; USART1 TXD input source
.equ CCL_INSEL1_SPI0_gc = (0x09<<4)      ; SPI0 MOSI input source
.equ CCL_INSEL1_TCA0_gc = (0x0A<<4)      ; TCA0 WO1 input source
.equ CCL_INSEL1_TCA1_gc = (0x0B<<4)      ; TCA1 WO1 input source
.equ CCL_INSEL1_TCB1_gc = (0x0C<<4)      ; TCB1 WO input source
.equ CCL_INSEL1_TCD0_gc = (0x0D<<4)      ; TCD0 WOB input source

; LUT Input 2 Source Selection
.equ CCL_INSEL2_MASK_gc = (0x00<<0)      ; Masked input
.equ CCL_INSEL2_FEEDBACK_gc = (0x01<<0)  ; Feedback input source
.equ CCL_INSEL2_LINK_gc = (0x02<<0)      ; Linked LUT input source
.equ CCL_INSEL2_EVENTA_gc = (0x03<<0)    ; Event input source A
.equ CCL_INSEL2_EVENTB_gc = (0x04<<0)    ; Event input source B
.equ CCL_INSEL2_IN2_gc = (0x05<<0)       ; IO pin LUTn-IN2 input source
.equ CCL_INSEL2_AC2_gc = (0x06<<0)       ; AC2 OUT input source
.equ CCL_INSEL2_USART2_gc = (0x08<<0)    ; USART2 TXD input source
.equ CCL_INSEL2_SPI0_gc = (0x09<<0)      ; SPI0 SCK input source
.equ CCL_INSEL2_TCA0_gc = (0x0A<<0)      ; TCA0 WO2 input source
.equ CCL_INSEL2_TCA1_gc = (0x0B<<0)      ; TCA1 WO2 input source
.equ CCL_INSEL2_TCB2_gc = (0x0C<<0)      ; TCB2 WO input source
.equ CCL_INSEL2_TCD0_gc = (0x0D<<0)      ; TCD0 WOC input source

; Sequential Selection
.equ CCL_SEQSEL_DISABLE_gc = (0x00<<0)   ; Sequential logic disabled
.equ CCL_SEQSEL_DFF_gc = (0x01<<0)       ; D FlipFlop
.equ CCL_SEQSEL_JK_gc = (0x02<<0)        ; JK FlipFlop
.equ CCL_SEQSEL_LATCH_gc = (0x03<<0)     ; D Latch
.equ CCL_SEQSEL_RS_gc = (0x04<<0)        ; RS Latch


;*************************************************************************
;** CLKCTRL - Clock controller
;*************************************************************************

; CLKCTRL_MCLKCTRLA masks
.equ CLKCTRL_CLKSEL_gm = 0x07            ; Clock select group mask
.equ CLKCTRL_CLKSEL_gp = 0               ; Clock select group position
.equ CLKCTRL_CLKSEL_0_bm = (1<<0)        ; Clock select bit 0 mask
.equ CLKCTRL_CLKSEL_0_bp = 0             ; Clock select bit 0 position
.equ CLKCTRL_CLKSEL_1_bm = (1<<1)        ; Clock select bit 1 mask
.equ CLKCTRL_CLKSEL_1_bp = 1             ; Clock select bit 1 position
.equ CLKCTRL_CLKSEL_2_bm = (1<<2)        ; Clock select bit 2 mask
.equ CLKCTRL_CLKSEL_2_bp = 2             ; Clock select bit 2 position
.equ CLKCTRL_CLKOUT_bm = 0x80            ; System clock out bit mask
.equ CLKCTRL_CLKOUT_bp = 7               ; System clock out bit position

; CLKCTRL_MCLKCTRLB masks
.equ CLKCTRL_PEN_bm = 0x01               ; Prescaler enable bit mask
.equ CLKCTRL_PEN_bp = 0                  ; Prescaler enable bit position
.equ CLKCTRL_PDIV_gm = 0x1E              ; Prescaler division group mask
.equ CLKCTRL_PDIV_gp = 1                 ; Prescaler division group position
.equ CLKCTRL_PDIV_0_bm = (1<<1)          ; Prescaler division bit 0 mask
.equ CLKCTRL_PDIV_0_bp = 1               ; Prescaler division bit 0 position
.equ CLKCTRL_PDIV_1_bm = (1<<2)          ; Prescaler division bit 1 mask
.equ CLKCTRL_PDIV_1_bp = 2               ; Prescaler division bit 1 position
.equ CLKCTRL_PDIV_2_bm = (1<<3)          ; Prescaler division bit 2 mask
.equ CLKCTRL_PDIV_2_bp = 3               ; Prescaler division bit 2 position
.equ CLKCTRL_PDIV_3_bm = (1<<4)          ; Prescaler division bit 3 mask
.equ CLKCTRL_PDIV_3_bp = 4               ; Prescaler division bit 3 position

; CLKCTRL_MCLKLOCK masks
.equ CLKCTRL_LOCKEN_bm = 0x01            ; lock ebable bit mask
.equ CLKCTRL_LOCKEN_bp = 0               ; lock ebable bit position

; CLKCTRL_MCLKSTATUS masks
.equ CLKCTRL_SOSC_bm = 0x01              ; System Oscillator changing bit mask
.equ CLKCTRL_SOSC_bp = 0                 ; System Oscillator changing bit position
.equ CLKCTRL_OSCHFS_bm = 0x02            ; High frequency oscillator status bit mask
.equ CLKCTRL_OSCHFS_bp = 1               ; High frequency oscillator status bit position
.equ CLKCTRL_OSC32KS_bm = 0x04           ; 32KHz oscillator status bit mask
.equ CLKCTRL_OSC32KS_bp = 2              ; 32KHz oscillator status bit position
.equ CLKCTRL_XOSC32KS_bm = 0x08          ; 32.768 kHz Crystal Oscillator status bit mask
.equ CLKCTRL_XOSC32KS_bp = 3             ; 32.768 kHz Crystal Oscillator status bit position
.equ CLKCTRL_EXTS_bm = 0x10              ; External Clock status bit mask
.equ CLKCTRL_EXTS_bp = 4                 ; External Clock status bit position
.equ CLKCTRL_PLLS_bm = 0x20              ; PLL oscillator status bit mask
.equ CLKCTRL_PLLS_bp = 5                 ; PLL oscillator status bit position

; CLKCTRL_OSCHFCTRLA masks
.equ CLKCTRL_AUTOTUNE_bm = 0x01          ; Autotune bit mask
.equ CLKCTRL_AUTOTUNE_bp = 0             ; Autotune bit position
.equ CLKCTRL_FRQSEL_gm = 0x3C            ; Frequency select group mask
.equ CLKCTRL_FRQSEL_gp = 2               ; Frequency select group position
.equ CLKCTRL_FRQSEL_0_bm = (1<<2)        ; Frequency select bit 0 mask
.equ CLKCTRL_FRQSEL_0_bp = 2             ; Frequency select bit 0 position
.equ CLKCTRL_FRQSEL_1_bm = (1<<3)        ; Frequency select bit 1 mask
.equ CLKCTRL_FRQSEL_1_bp = 3             ; Frequency select bit 1 position
.equ CLKCTRL_FRQSEL_2_bm = (1<<4)        ; Frequency select bit 2 mask
.equ CLKCTRL_FRQSEL_2_bp = 4             ; Frequency select bit 2 position
.equ CLKCTRL_FRQSEL_3_bm = (1<<5)        ; Frequency select bit 3 mask
.equ CLKCTRL_FRQSEL_3_bp = 5             ; Frequency select bit 3 position
.equ CLKCTRL_RUNSTDBY_bm = 0x80          ; Run standby bit mask
.equ CLKCTRL_RUNSTDBY_bp = 7             ; Run standby bit position

; CLKCTRL_OSCHFTUNE masks
.equ CLKCTRL_TUNE_gm = 0xFF              ; Tune group mask
.equ CLKCTRL_TUNE_gp = 0                 ; Tune group position
.equ CLKCTRL_TUNE_0_bm = (1<<0)          ; Tune bit 0 mask
.equ CLKCTRL_TUNE_0_bp = 0               ; Tune bit 0 position
.equ CLKCTRL_TUNE_1_bm = (1<<1)          ; Tune bit 1 mask
.equ CLKCTRL_TUNE_1_bp = 1               ; Tune bit 1 position
.equ CLKCTRL_TUNE_2_bm = (1<<2)          ; Tune bit 2 mask
.equ CLKCTRL_TUNE_2_bp = 2               ; Tune bit 2 position
.equ CLKCTRL_TUNE_3_bm = (1<<3)          ; Tune bit 3 mask
.equ CLKCTRL_TUNE_3_bp = 3               ; Tune bit 3 position
.equ CLKCTRL_TUNE_4_bm = (1<<4)          ; Tune bit 4 mask
.equ CLKCTRL_TUNE_4_bp = 4               ; Tune bit 4 position
.equ CLKCTRL_TUNE_5_bm = (1<<5)          ; Tune bit 5 mask
.equ CLKCTRL_TUNE_5_bp = 5               ; Tune bit 5 position
.equ CLKCTRL_TUNE_6_bm = (1<<6)          ; Tune bit 6 mask
.equ CLKCTRL_TUNE_6_bp = 6               ; Tune bit 6 position
.equ CLKCTRL_TUNE_7_bm = (1<<7)          ; Tune bit 7 mask
.equ CLKCTRL_TUNE_7_bp = 7               ; Tune bit 7 position

